/*
 Navicat Premium Data Transfer

 Source Server         : 本地
 Source Server Type    : MySQL
 Source Server Version : 50710
 Source Host           : localhost:3306
 Source Schema         : bbs

 Target Server Type    : MySQL
 Target Server Version : 50710
 File Encoding         : 65001

 Date: 21/04/2022 09:53:52
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for admin
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `admin` varchar(12) CHARACTER SET utf8 NOT NULL,
  `password` varchar(18) COLLATE utf8_bin NOT NULL,
  `id` int(255) unsigned NOT NULL AUTO_INCREMENT,
  `power` int(1) unsigned zerofill NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of admin
-- ----------------------------
BEGIN;
INSERT INTO `admin` VALUES ('admin', 'admin', 1, 1);
INSERT INTO `admin` VALUES ('lokep', 'admin', 2, 0);
INSERT INTO `admin` VALUES ('test123', 'test123', 3, 1);
COMMIT;

-- ----------------------------
-- Table structure for article
-- ----------------------------
DROP TABLE IF EXISTS `article`;
CREATE TABLE `article` (
  `id` bigint(32) NOT NULL AUTO_INCREMENT,
  `articleID` varchar(255) COLLATE utf8_bin NOT NULL,
  `author` varchar(255) COLLATE utf8_bin NOT NULL,
  `authorID` varchar(255) COLLATE utf8_bin NOT NULL,
  `title` varchar(255) COLLATE utf8_bin NOT NULL,
  `content` longtext COLLATE utf8_bin NOT NULL,
  `createAt` datetime NOT NULL,
  `tagName` varchar(255) COLLATE utf8_bin NOT NULL,
  `tagCode` varchar(255) COLLATE utf8_bin NOT NULL,
  `agrees` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `disagrees` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `comments` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `collects` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `noInterests` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  `accusation` varchar(255) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of article
-- ----------------------------
BEGIN;
INSERT INTO `article` VALUES (15, '1553238742000', 'lokep', '1550800739000', 'i am iron man ', '通过在NodeJs中，添加可访问的静态资源的文件夹 cms,存放相应请求接口返回json数据，模拟请求后台数据通过在NodeJs中，添加可访问的静态资源的文件夹 cms,存放相应请求接口返回json数据，模拟请求后台数据通过在NodeJs中，添加可访问的静态资源的文件夹 cms,存放相应请求接口返回json数据，模拟请求后台数据通过在NodeJs中，添加可访问的静态资源的文件夹 cms,存放相应请求接口返回json数据，模拟请求后台数据通过在NodeJs中，添加可访问的静态资源的文件夹 cms,存放相应请求接口返回json数据，模拟请求后台数据\n\n\n', '2019-03-22 00:00:00', '代码写诗', '1551855789015', '73', '5', '189', '292', '31', '27');
INSERT INTO `article` VALUES (16, '1553310680000', 'lokep', '1550800739000', '如果神话传说都是真的，世界会变成什么样子？', '1. 淅淅沥沥的小雨打在屋檐，溅起一片片水雾。云压得极低，让人喘不上气。 这是雷震子与索尔的第六次斗法，他吃了大亏，羽毛被火燎掉了一半，露出鲜红的肉翼，空气中弥漫着浓郁的蛋白质烧焦气味。 如马尔克斯在《百年孤独》里形容的一般，雷震子买了一张永久车票，登上了一列永无终点的火车。这是必死的征途。 雷震子选择加入东方仙人联盟的那一刻就已经料到了结局。可他不能后退哪怕一步，因为身后有他的亲友，有他的祖国，还有十四亿毫无能力的普通人。 他艰难的爬起来，手里抓着已经残破不堪的黄金棍，用尽全力挥向索尔。 “何苦呢？”索尔叹了口气，问道。 “因为我的双膝，只跪给父母！” 2. 公元二零一五年十一月七日，梵蒂冈教廷联合世界树密会发表声明，要求全部人类立即停止一切科学研究，放弃对神之秘宝的探索，避免毁灭性打击。 世界一片哗然，纽约时报、英国太阳报等刊文：“神棍的妄想症严重到必须送入医院强制治疗。”官方网站公开投票，70%以上美国民众表示赞同。各国家外交部均予以不理睬政策。 次日凌晨，巨大不明生物袭击米国白宫，将其夷为平地。白宫护卫军队全军覆没，伤亡人数过万，后世称其“十一·八袭击”。 据目击者称，袭击者骑乘一匹十数米高的八足巨马，手掌掷矛，每次出手必定毁灭目标。疑似北欧主神奥丁。 米国全面进入战争状态，进行了英勇的抵抗。但加入战争的神越来越多，米军节节败退，几欲亡国。终于，米国动用了核武器。 二零一五年十二月二十五日，十万米军以生命为代价拖住几位神祗。50万吨级的原子弹在内华达州和亚利桑那州交界地带黑峡引爆。胡佛溃坝，下游地区洪水泛滥，后世称之为“上帝之殇”。森林之神维达，智天使加百列在此役中殒落。 教廷和金宫震怒，对人类全面开战。第三次世界大战就此展开序幕。 战火烧遍了全球，更多的神想要分一杯羹。奥林匹斯山派使者觐见奥丁，组成欧洲神祗联盟。 二零一六年二月三日，欧洲神祗联盟进军日国，日国本土神祗迎战。 二零一六年二月七日，日国发生9.2级地震，富士山爆发。火之迦具土神在决斗中殒落，八岐大蛇被斩五首，受天照营救落荒而逃。日国沦陷。 此事一出，天下大震。李耳出面组织东方仙人联盟，与欧洲各神祗对峙，进入冷战阶段。双方众神相互敌对，摩擦迅速升级。 二零一六年五月五日，雷震子决斗索尔，殒落。玉柱洞云中子大怒出山，一天之内手刃洛基、狄俄尼索斯等多位欧洲神祗为徒弟报仇，至此双方再无回旋余地。 大战一触即发。 3. “C组已就位，请通报敌人位置，完毕。” “北偏东34度12分，直线距离2千米，圣殿骑士102人，带队天使乌里叶，无异常反应，完毕。” 天气有些阴冷，秋风瑟瑟，杨戬的斗篷微微浮着，有一种飘逸的美。 C组只有两个人，再精确一点，是一人一狗—杨戬和哮天犬。他们搭档了上千年，早已经有了默契，侦查突袭的任务也做了不只一次，至今还未失手。这次联盟派遣他俩，也是因为对方护送的东西确实至关重要。 杨戬揉了揉哮天犬的头，站起了身子。 他想起当年和孙悟空打的那一架，那才叫爽快，也不知道这一千八百多年后年，面对西洋神祗，能不能再找回酣畅的感觉。杨戬很期待，他的三尖两刃刀已经很久没沾血了。 “让我见见你们的本事吧。”杨戬嘴角上扬，向敌人疾驰而去。他丝毫不掩饰的冲刺带起滚滚尘土，如同一条青龙直插阵中。 乌里叶瞬间就进入了战斗状态，神情严肃。他能感觉到面前敌人的强大，即便拥有智天使称号的自己应付起来也绝对不容易。 杨戬持刀前刺，暴戾的风在刀身打转，那一瞬间，竟是把空气都劈成了两半。 乌里叶大惊失色，六翼挥动，向后躲避。同时手中圣剑格挡。 只一下，乌里叶的剑就飞了出去。杨戬哈哈大笑，道：“你这鸟人，和泼猴相比差的太多了。” 乌里叶不敌，两人斗了才不到十个回合。哮天犬一口咬在乌里叶脚踝处，扯住了他的身体。杨戬闪到乌里叶身后，挟住他的翅膀，大喝一声，撕了下来。 乌里叶痛苦的哀嚎，杨戬把他踩在脚下，迎着着圣殿骑士们恐惧的目光，扭断了他的脖子。而后悠悠一叹：“寂寞啊。” 哮天犬附和着汪了两声，趾高气扬的站在主子身边。 杨戬掏出震动许久的对讲机，按下了接听键。 “快逃啊！” “嗯？” 巨大的魔狼直扑杨戬，他嗅到哪巨口中死亡与血腥的恶臭，第一次感受到了危险。那是能轻易切断战神提尔手腕的利齿，是能吞噬日月的死神獠牙。 “汪呜—” 哮天犬跃起，拦住主人身前，只是眨眼间就隐没于芬里厄的嘴中。 “哮天！”杨戬红了眼睛，三尖两刃刀由芬里厄的喉咙刺进心脏，狼血染红了白甲。 灌江口相遇，三渡于草莽。 杨戬剖开了芬里厄的肚子，眼泪止不住的滴。哮天犬把眼睛睁开一点缝隙，伸出舌头舔掉杨戬的泪，摇了摇尾巴，再也不动。 对讲机里传出撤退的命令，杨戬一脚将其踩碎，仰天长啸。 第三只眼霍然圆瞪，一丝阴云掩盖了日光。 要流血了。 二零一六年十月七日，杨戬、哮天犬遭遇陷阱，斩杀智天使乌里叶，后与中庭之蛇耶梦加德、魔狼芬里厄、冥界女王海拉三兄妹同归于尽。 4. 相比各路神仙，猴子总是无忧无虑的。 今天喝点小酒，明天吃点水果，带着手下一帮小弟开开心心的在花果山上嬉游，这就是孙悟空最大的快乐。神间的大战没波及大雷音寺，悟空倒也乐得清闲做一个闲散佛陀。 阳光铺在水帘之上，透点波光，照亮了孙悟空的面庞。 悟空斟了杯酒，叹了口气，把酒洒在地上。酒滴被穿堂风卷着散在空气里，映出一道彩虹。 顿了一会儿，又另斟了一杯，语带悲伤道：“真君啊，天庭里三清四御纵然法力无边，俺老孙也不曾服气，唯独你不同。哪想百年未见，你却落得个神魂俱灭。唉，这樽仙酿，俺老孙先干为敬了。” 悟空将杯中的酒一饮而尽，久久不语。 “报告大王！外面有个肥头大耳的人说要见你！”几只小猴毛手毛脚的窜进水帘洞，冲着孙悟空叫道。 孙悟空收起悲戚，哈哈笑道：“孩儿们，把他给我压上来！” 几只小猴闻令告退，只等了片刻，便带了一胖子上殿，那胖子被捆的结结实实，不断的挣扎，破口大骂道：“你这该死的弼马温！上千年过去连点花样都不换！” 孙悟空走上前去，打量胖子一番道：“我当是谁呢，原来是八戒啊，什么风把你吹到我这小山头了？” “弼马温，你先把你猪爷爷放下！我有急事和你说！” 孙悟空转身回到自己座位上，拿起个桃子咬了一口，摆了摆手，含糊不清的道：“给这呆子掌嘴。” “哎哎哎，猴哥儿，你在那诸天神佛里都是排得上号的人物，怎好与俺老猪这样不识眼色的小人物计较。”八戒急忙讨饶。 孙悟空听了好笑，吩咐猴子们给猪八戒松绑，寻问他来意。 “大事不好啊大师兄！”八戒急切的道，“俺和沙师弟陪师父去那金宫说和劝善。本想着平稳事态，哪想那些小神野蛮的很，两句不和就要动手。我拼尽一身法力才闯了出来，可沙师弟却被打成重伤，师父也被擒住了！” 悟空脸色越来越阴沉，最后一拳砸下，桌子瞬间化为齑粉，酒杯碎了一地。 “蠢货！”孙悟空气的牙根痒痒，“师父要是出了什么事情，我扒了你这一身猪皮！” 八戒唯唯诺诺的不敢搭话，悟空站直身子，神情严肃，召来了全部猴子猴孙。 “孩儿们，俺老孙寄情山水千年的自由全是俺师父给的。现在师父有难，俺就算是拼上这条薄命，也必须要帮。”孙悟空中气十足道，“尔等就在花果山好生候着，照顾好这呆子。待俺杀上那甚么劳什子金宫，救出师父，再回来给孩儿们奖赏！” 悟空语毕，窜了出去，踏上筋斗云，几个跟斗风驰电掣便杀向金宫。 欺人太甚，实在是欺人太甚！今天就要让这群狗屁伪神知道孙爷爷的厉害！ 头配凤翅紫金冠，身被锁子黄金甲，足踏藕丝步云履，手擎如意金箍棒。 悟空逆风而行，怒吼一声，将棍子甩了出去。 “轰—!” 英灵殿的正门被孙悟空一棍击破，奥丁骇然抬头，露出了难以置信的神色。 “吃俺老孙一棒！”悟空掣开铁棒，幌一幌，愈变愈大，直到二人环抱粗细，怒啸横扫。 Sleipnir挡在奥丁面前，被金箍棒砸个正着。骏马一声悲嘶，不断喷吐的雷云闪电消散，八只巨足尽数折断。 奥丁金色的双眸中燃烧起怒火，右手紧紧握住Gungnir。世界树枝制成的枪柄泛起熔金般的光芒。 昆古尼尔，永恒之枪。 在阿萨神族和华纳神族开战时，就是由奥丁拿着这把神枪投出第一击。它的能力极致单纯，却暴力无比，那就是—必杀。 昆古尼尔所指向的任何敌人，都会被刺穿胸膛！ 奥丁愤怒的咆哮，他举起昆古尼尔，奋力掷出。耀目的光芒如闪电般划破天空，星辰黯淡，日月失色，就连时间都都在瞬间停止。 除了孙悟空。 如意金箍棒缩小到正和手的大小，悟空抬起手，毫无二心的将金箍棒指向身前。如同能预知昆古尼尔的轨迹。 “破。”悟空道。光芒炸碎！ 奥丁喷出金色的血液，无力的坐在地上，他艰难的开口：“为什么…” “超脱三界外，不在五行中。”悟空缓缓说道，而后拔下来一簇毫毛，洒在空中，“开始吧。” 二零一六年十月二十四日，斗战圣佛孙悟空大闹圣灵殿，击杀镇守者主神奥丁，成功营救旃檀功德佛唐玄奘。金身罗汉沙悟净此前护法身受重伤，次日于花果山陨落。 5. “啊！” 我猛然惊醒，握住了腰间的格洛克。周围没有天使，没有恶魔，也没有其他什么形形色色奇怪的东西。我长出一口气，擦了擦冷汗。 我是一个普通人，不会仙术也不会异能，在神与神的夹缝中苟活，尽管五年前我还不相信有神这种东西。 这个世界对我们普通人其实很不友好，或许以前是友好的，但现在我只能感受到满满的恶意。灼得我浑身疼痛。 就在五年前，我还是个中二的少年的时候。第三次世界大战爆发了。同学死了，学校被毁成一片废墟，亲人被突如其来的袭击冲散。 我想，我的机会来了。这是我成为屠龙骑士的最好机会，我将仗剑天涯，远方的公主等待着我的拯救。 然后骑士来了，砍了公主的头，一把火烧了我的家。我这才知道，骑士不只是屠龙的，他们有时也是普通人的刽子手。我的梦想随着滚滚升腾的浓烟一起消散。 时间会改变很多东西，于我来说，热血凉了。我只是依靠手里的枪，机械的复仇，担惊受怕的活着。 我为什么还不死呢？ 我也不知道，或许是怕疼吧。 我起身站直，伸了个懒腰，关节嘎嘣嘎嘣的响。天空还是布满阴云。 核冬天。我嗤笑了一声，收拾好行装，掩饰自己过夜的痕迹，端着枪上路。 “c17呼叫总部，请求弹药补充。完毕。” “距离你此刻位置直线距离12公里处，是华夏第七陆军基地，你可以在那获得补给，路线已发送至你的个人PDA，祝你好运，中士。”对讲机中传出了冰冷的女声。 我打开PDA，调出路线图，那是条曲折的路线，估计不会好走，但我别无选择。生活磨平了我的棱角，但却让我更加坚韧，这或许是唯一的好处。 四小时后，我站在了基地门口。这里喧闹不堪，所有人都在备战。我拽住一位士兵，向他询问情况。 “米迦勒要亲自带军攻打这里。” 大天使长米迦勒。我微微叹了口气，同情的看了一眼这个即将不复存在的地方，转身离去。 “小九！”李秋沐脆生生的叫住了我。 我回头，惊喜的看着这个曾经照顾我的姐姐。那是五年前，她拉住了我的手，把我从楼顶拉下来，又一耳光扇醒了我，让我断了自杀的念头。 那时候她说：“不要被懦弱压倒啊。”我一直谨记在心。 胖子笑眯眯的看着我，小猫还是一副不理人的模样，顺子叼着烟，冲我挥挥手。我上去拥抱他们每个人。心中泛起了久违的温暖。 我最终没有离开基地，当天夜里我喝了许多的酒，在PDA里加了联系人，约定加入他们的团队。我们讲述了自己离别四年来的经历，阵阵唏嘘。 “呜—”防空警报的声音响起。我倏然起身，脑袋狠狠的撞了一下。 我看着眼前的路虎方向盘，一阵迷茫。我甩了甩头，宿醉的感觉告诉我，昨天的一切都是真实发生的。可是现在却只有我一个人。 防空警报还在继续，我下了车，打开后备厢。 满满两大箱武器弹药，还有近乎奢侈的汽油和食物，充足的像是大战之前。我隐约意识到了什么。 我急忙掏出PDA，找到李秋沐，按下了通话键。时间一分一秒过去，正当我抓心挠肝时，终于通了。 对面杀声震天，枪炮怒吼混成一片。李秋沐语气冷淡，“什么事？” 我说沐姐，那是米迦勒，大天使长，你打不过他，这是螳臂当车。 她沉默了一会儿，说我已经决定了，我把所有的东西都给你了。你要活，不要被懦弱压倒，神也是能够被杀死的。 “你还有很多机会！”我怒吼。 “小九，你说真的会有天堂吗？” “沐姐，别搀和了，我们不行的，他们是神！” “小九，你长大了。” 李秋沐发出一声轻笑，然后是机枪扫射的声音。我仿佛能看到她矫健的身影，她架着机枪杀死一个又一个圣殿骑士，短发被灼热的空气吹的飞扬。 红色的十字架在米迦勒手中闪耀，乌云中隐约透出的日光照射下，炽天使的六翼舒展。 我仿佛听见肉体被切割的声音。 “小猫，你听我说，你现在出城找我，我们一起离开这儿，我们没必要去送死，这是没有意义的！” “怎么能是没有意义的呢？”小猫淡淡的道，“我们的亲人在战火中连尸骨都没能留下，我们的朋友一个接着一个倒在眼前，我们的土地上布满了异族人的军队。而现在我们终于可以用自己所拥有的东西去换点什么，怎么能是没有意义的呢？” 我说你怎么那么死心眼，你付出自己的命，米迦勒也不会掉一根羽毛！ 小猫说，那也无所谓，胖子已经死了，他在我面前被斩断了四肢。他说你跑啊，和小九一起跑，小九是个好男孩，你是个好女孩。 我感受到了小猫无尽的悲痛，深入骨髓。那个一直笑眯眯的男人，那个始终挡在她面前的男人，那个曾经揉着她的头发的男人，在她的面前被砍掉了四肢，让她逃。 “杀了他们。”我喃喃道。 “我会的。” 小猫握着匕首，切开一个又一个敌人的喉咙。骑士剑从她背后插入，又从胸口透出。头绳滑脱，缎子般的秀发散开。 圣殿骑士眼神淡漠的看着她，小猫咧开嘴笑了笑，冲骑士脸上吐了一口血痰。 她的头颅被斩了下来。 我坐在驾驶位，愤怒的砸方向盘。眼泪不争气的流。 “九哥，你那有烟吗？”顺子问。 我说有，你来找我。 顺子呵呵一笑，“点在我的坟前。” 我说你他妈傻逼，你们都他妈是傻逼，你们以为自己遇到神上去送死很高尚？都他妈是蜉蝣撼大树！全他妈是送死！ 我听到顺子点起一根烟，他说是啊，我们都是去送死，可是除了送死我们还能做什么呢？我们在这世界上苟延残喘，永远只是个蝼蚁，我们就只剩下了拼命的权利，所以我要去死。 我无言以对。 圣殿骑士的长剑闪烁着圣光，似乎要从顺子的灵魂中照出点什么阴暗的东西。 顺子掐灭了烟，把手枪上了膛，指向圣殿骑士的脸。 “真他妈丑啊。” 我的胸口如同压了一块巨石。沐秋、胖子、小猫、顺子，他们把生的希望给了我，自己走向充斥着烈火的深渊。 不要被懦弱压倒啊。 我启动车子，用尽全力转动方向盘，踩下了油门。 6. “三太子，总部发来消息，索尔，哈迪斯两大实力神祗正往这边行军，咱们该撤退了。” 哪吒用手指点着桌子，道：“再等等，土地公公，我想见一眼索尔。” 土地神叹了口气，从帐篷里退了出去。 哪吒明白土地神的担忧，冥王哈迪斯、雷神索尔，不知道有多少东方仙人倒在他们面前。一旦和他们对上，以自己的能力，恐怕凶多吉少。但他仍然想知道杀了雷震子的人究竟长什么样子。 哪怕明知风险。 哪吒心中烦躁，起身从帐篷中出来。天空中阴云密布，直压着地平线，戈壁滩边的小绿洲似乎都带上了墨迹的颜色。风如刀子般贴着他的脸庞划过，扬起一道道沙土。 五年来，双方都受了极大的损失，下层天兵天将殒落者不计其数。哪吒不能理解西方众神的行为，为什么要杀戮呢，为什么不能共处呢，都已经有了无限的寿命，为什么还要贪图更多的东西。 没人告诉哪吒他是为了什么而战斗，他只是机械的攻击、防御，偶尔想起雷震子等故去的挚友，便坚定自己的信念。 “三太子，咱们真的该撤退了，危险系数太高，总部那边催了许多次了。”土地神又一次走到哪吒身边，焦急的说道。 “你们先走吧。我再等等。”哪吒面无表情。 “诶哟我的三太子，那索尔什么时候见不行啊！这次是真的危险，咱们驻守的神将就只有您一人堪堪一战，根本不可能挡住索尔哈迪斯联手，留得青山在，不怕没柴烧，您就听我一次。” 土地神絮絮叨叨说了一大堆，哪吒不耐烦道：“我命令你们现在收拾行装撤离，我的问题我会自己和总部说。” 土地神还想再说什么，却见哪吒摆摆手，只好告退。 很快，驻守临时基地的众小神都收拾好行装，一一与哪吒告别。 土地神是最后一个走的，他说三太子，小神承蒙李天王提携，当上这一官半职，无以为谢，儿时习得一招防护秘法，请让我为您加持。 哪吒点点头，任由土地神用血在自己的手腕上刺下一道符印。刺罢，土地神深深的看了哪吒一眼，旋身消失不见。 风越来越大，漫天的沙尘遮掩了视线，本来没多少光线的营地显得更加阴森。混天绫在风中噼啪作响。哪吒如雕像般伫立在营地中央，他合着双目，也不知道是养神还是思考。 远方传来行军的人声，哪吒睁开眼睛，影影绰绰的看不清楚。但他知道，是敌人来了。 哪吒微微附身，把PDA放在地上，然后踏上了风火轮。 几千里外，土地神坐在自己的小庙里，痛苦的捂着胸口，那上面焦黑一片，似被闪电击中。是替生符咒的效果。老人紧紧握住竹杖，爽朗的笑。嘴角流下鲜红的血，一如混天绫的颜色。 哪吒刚和索尔对拼了一记。乾坤圈打碎了索尔半扇肋骨，巨大的闪电也击穿了自己的胸膛。哪吒看了一眼手腕已经消失的符咒，心想这东西还真不错，倒是可以推广一下。 哪吒定下心神，右手一翻甩出一块金砖。索尔急忙抬起重锤格挡。巨大的金铁交击声后，两人同时退了一步。 “是你杀了雷震子？” 索尔一愣，没想到面前的人会问他这个问题，他的眼中闪过一丝怀念，道：“没错，他是值得尊敬的对手。” 哪吒沉默了一下，激发了火枣的仙力，三头六臂破体而出。火尖枪泛起金光与阴阳剑的青气纠缠在一起，绕着哪吒盘旋，只是一瞬，气势恢弘如斯。 “我会杀了你。” 索尔举起锤子，雷电四溢，“请便。” 两人同时弓身，如脱弦之箭般碰撞在一起，手中兵器相触，深蓝的电弧与红色长绫不断的碰触分离，似两条长身蛟龙共舞，七彩的电浆飞溅喷涌，一时间竟是天地失色！ 哪吒右脚一顿，身体绕着索尔转了个圈，混天绫顺势攀上索尔的右手，控制了他的行动。哪吒四臂齐抬，阴阳剑与火尖枪就要插进去。 “啊—！”哪吒发出了撕心裂肺的咆哮，五马分尸一样的痛苦使他瞬间大脑一片空白。 三头地狱犬刻耳柏洛斯喷薄着恶臭气息的巨口咬住了哪吒的手臂，疯狂的撕了下来。蛇尾一甩，将哪吒抽飞出去。身上毒蛇化成的毛发喷吐着毒液，落到地上，乌头草蓬勃生长。 “哈迪斯！”索尔转身怒视，“你他妈的不要插手我的战斗！” 哈迪斯无所谓的耸了耸肩，脸上露出阴毒的笑意。 “呵…呵…”哪吒喘着粗气，从地上爬了起来，断臂处血流滚滚。 刻耳柏洛斯喷出一口黑气，冲向哪吒，正当獠牙即将碰触哪吒的咽喉时，哪吒突然收回了六臂。 九龙烈火罩祭出，将地狱三头犬镇在其中，烈焰贴上刻耳柏洛斯的皮毛，化为九条火龙。 滚滚龙吟与刻耳柏洛斯的悲嗥混合在一起，哪吒一步踏出，朵朵莲花在乌头草中绽放。 哈迪斯变了脸色，谨慎的举起双叉戟，作出迎战的姿态。 哪吒双目清明，松开了手里的兵器。混天绫与乾坤圈化为一金一红两道光束，冲入云霄，在乌云中炸碎。 积压已久的阴霾，消散了！ 阳光穿过乌云中央的大洞散射下来，正打在哪吒身上，绽放出万道霞光。索尔突然有种朝拜的冲动。 哪吒仿佛能听到雷震子和杨戬等已故挚友的声音。 他们说：“歇息吧！” 百朵莲开。 二零二零年五月十七日，哪吒独自拦截敌军，斩杀三头地狱犬刻耳柏洛斯，冥王哈迪斯，重创雷神索尔后化莲殒落。陈塘关土地神因替身符咒共殒。 7. 匕首在阿努比斯的手中翻飞跳跃，他思索着，久久才开口，“阿普切先生，请允许我这么称呼您，您怎么能让我们相信，您是带着诚意来的呢？” 阿普切摸了摸自己的雪橇铃，用嘶哑的声音说道：“库库尔坎会献出它的一枚血麟，阿努比斯，你知道那意味着什么。这是伊扎姆纳大人的底线了。” 库库尔坎的血麟！阿努比斯的气息有些粗重，他和荷鲁斯对视一眼，都看到了对方眼里的惊喜与贪婪。据说得到库库尔坎的血麟就可以提升神格的层次，这几乎是每个神祗都梦寐以求的机缘。 阿努比斯压住心中的热切，刚要开口，被空气中震动的能量惊得站了起来。荷鲁斯冲他摇摇头，安抚他坐下，拉威严的声音倏然响起。 “我可以答应你，阿普切先生，但我还有一个要求。” “伟大的太阳神，您请说。”阿普切尊敬的弯下自己的腰，这位的神力远不是他所能及的，他必须摆出一定的姿态。 “同意撒旦的加入。”拉的声音震慑人心，“他会使我们的联军更加无往不摧。” 阿普切微微沉吟，然后点点头，“如您所愿。” 巨灵神整整两天没能睡个好觉。他所在的基地是华夏最强的基地之一，除非是十二泰坦或是密米尔这样的强大存在袭击，否则陷落的可能性近似为零。可他还是隐隐不安。 他在这儿只是一个小小的士官，但他还是和托塔天王说了自己的预感。天王派了顺风耳和千里眼侦查，却是什么也没发现。 巨灵神点起一根香烟，这是他在人间发现的好东西。 烟雾由他嘴中吐出，盘旋而上，消散在空中。一丝阴云遮住了阳光。 黑色的碎片在空中凝结拼装，一点点成型。狰狞的巨门拔地而起，血腥之气扑面而来，那一瞬间，巨灵神听到了无数冤死的魂灵痛苦的尖号。 狗头人身的神灵轻轻的落在地上，巨灵神甚至无法回忆起他出现的方式，似乎他本来就该在哪里。他左手擎着一柄宽刃镰刀，右手拿着一块黑曜石，冲巨灵神作了个揖。 “赞美你，啊拉，向着你惊人的上升 你上升，照耀，令诸天向一旁滚动。 你是众神之王，万物之主， 我们自你而来，因你而成神圣。” 他将黑曜石拍进了巨门，巨门瞬间燃起了血色的烈焰！ 巨灵神瞪大了眼睛，香烟掉在地上，溅起火花。 “敌袭！！！” 一道光箭穿过巨灵神的胸膛，他长着嘴，声音被扼在喉咙里，缓缓倒地。 身后三对黑翼的天使狂笑着从地狱之门中飞出，手中握着十字长剑末日审判。他舞了个剑花，长啸到：“我！路西法，晨星之子，向你们问好！” 地狱之门一次次窜出火焰，越来越多的恶魔从里面钻出来。十只，百只，千只，万只。 无数恶魔咆哮着，怒吼着，举起自己的武器，冲向基地。 踏平！踏平！杀戮一切！毁灭一切！ 李靖看着眼前的景象，紧紧攥住了自己的宝塔。他想起了千年前面对陈唐关大水时的无力感。 恶魔如潮水般涌来，众仙纷纷祭出法宝，逆锋而上。 萨麦尔尖笑着剜出千里眼的眼睛，塞进嘴里咬碎，血液涂满了牙齿。手中长枪挥舞，刺穿一枚又一枚心脏。 吕洞宾下腰躲开亚巴顿的斧击，单手撑地腾空，折扇直插。亚巴顿后撤，正迎上铁拐李的重拳。只一下，拳气便打折了他的脊椎。 圣甲虫从泥土里钻出来，淹没了倒地的天兵。惨叫声，喊杀声，无论恶魔还是仙人，都杀红了眼。 阿努比斯挥动着死神镰刀，剧毒的黑烟缠上李靖的宝剑。李靖松开剑，祭出玲珑宝塔，将阿努比斯镇在下面。 “撤啊！都他妈撤啊！”李靖撕心裂肺的怒吼。 红色的手指插入他的胸膛，轻轻的掏出了心脏。撒旦伸出舌头轻轻舔舐着，火焰将心脏烧成灰烬。 李靖矗立不倒，撒旦饶有兴致的看了他一眼，转身离开，在地上留下一串烧焦的足印。 二零二一年三月十二日，第三方加入战争。恶魔联军袭击东西双方军队，使其伤亡惨重。托塔李天王等众多仙人殒落。天使军团除拉斐尔一人，全军覆没。 二零二一年四月七日，十二泰坦参战，大战雨神恰克、死神阿普切。灵宝道君出山。上等神位者正式加入战斗。 8. 宙斯已经逃了三天三夜，他从来没这么窝囊过，以他的神力，即使是十二泰坦，也可以拼个平手。但是他却被一个老头儿打的连他妈都认不出来。 哦不对，大部分伤是被那老头儿牵着的青色水牛踢的，这简直是耻辱，宙斯恨不得自己把自己弄死。 “小娃娃，我们又见面了。” “我操！老头儿你他吗骑的是火箭吗！” 宙斯大惊失色，伸手聚集起了雷霆怒火，轰向老头儿。 那老头儿随手一挥扁拐，把雷霆打散，笑呵呵道：“娃娃，你这小闪电倒是有趣，虽是兵器，却不能被我那金刚琢收了去。” 宙斯听了差点气得吐血，心想我无往不利的雷霆，在你嘴里变成了小闪电，竟然还说不错，有没有这么寒碜人的。 宙斯又甩出一道雷霆，飞速逃亡，眨眼间便消失无踪。 老头儿伸手擒住雷霆，翻来覆去地瞧，脸上露出好奇的神色。 高加索山脉的罡风没日没夜的冲刷着岩石。巨大的铁链哗啦作响，与地上巨鹰的尸骨构成一片荒凉之景。 “伊阿佩托斯的儿子，尊贵的王，我的好朋友，我遇到了最大的劫难，渴求您的帮助。”宙斯立在木屋门前，低沉的道。 门开了，普罗米修斯把宙斯迎进屋内。他倒了两杯酒，放在桌上，叹了口气。 “伟大的众神之父，追袭您的人，名曰太清太上老君，他几乎是世界上最顶尖的神祗了。我不认为自己比您更有能力与他战斗。” 宙斯摇晃着酒杯，缓缓道：“我需要您的智慧。” 普罗米修斯笑了，他说伟大的神父，您真的会听我的吗？曾经我跟您说，不要因为答应保护人类而提出苛刻的献祭条件，您没收了人类的火焰。我把火种带给人类，您却用一条永远也挣不断的铁链把我缚在这儿，使我永远不…', '2019-03-23 00:00:00', '代码写诗', '1551855789015', '65', '29', '219', '242', '20', '26');
INSERT INTO `article` VALUES (17, '1553855242000', 'lokep', '1550800739000', '撒打開拉薩的開發了', '撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了', '2019-03-29 00:00:00', '这个设计有点优秀', '1551855789014', '5', NULL, NULL, NULL, NULL, NULL);
INSERT INTO `article` VALUES (18, '1553855242000', 'lokep', '1550800739000', '手動閥十分大方', '撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了撒打開拉薩的開發了', '2019-03-29 00:00:00', '人在职场', '1551855789009', '5', NULL, NULL, NULL, NULL, NULL);
COMMIT;

-- ----------------------------
-- Table structure for articlecollection
-- ----------------------------
DROP TABLE IF EXISTS `articlecollection`;
CREATE TABLE `articlecollection` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `articleID` varchar(255) COLLATE utf8_bin NOT NULL,
  `userID` varchar(255) COLLATE utf8_bin NOT NULL,
  `createAt` varchar(255) COLLATE utf8_bin NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- ----------------------------
-- Records of articlecollection
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for articleimg
-- ----------------------------
DROP TABLE IF EXISTS `articleimg`;
CREATE TABLE `articleimg` (
  `aid` varchar(255) COLLATE utf8_bin NOT NULL,
  `id` varchar(255) COLLATE utf8_bin NOT NULL,
  `path` varchar(255) COLLATE utf8_bin NOT NULL,
  `name` varchar(255) COLLATE utf8_bin NOT NULL,
  `createAt` varchar(255) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of articleimg
-- ----------------------------
BEGIN;
INSERT INTO `articleimg` VALUES ('1553238742000', '1553238742000', '/public/images/', '1553238742000.png', '15:12:22');
INSERT INTO `articleimg` VALUES ('1553842589000', '1553842589000', '/public/images/', '1553842589000.png', '14:56:29');
INSERT INTO `articleimg` VALUES ('1553855242000', '1553855242000', '/public/images/', '1553855242000.png', '18:27:22');
INSERT INTO `articleimg` VALUES ('1553934183000', '1553934183000', '/public/images/', '1553934183000.png', '16:23:03');
COMMIT;

-- ----------------------------
-- Table structure for comment
-- ----------------------------
DROP TABLE IF EXISTS `comment`;
CREATE TABLE `comment` (
  `id` int(32) NOT NULL AUTO_INCREMENT,
  `parentID` int(11) DEFAULT NULL,
  `userID` varchar(255) COLLATE utf8_bin NOT NULL,
  `createAt` varchar(255) COLLATE utf8_bin NOT NULL,
  `content` longtext COLLATE utf8_bin NOT NULL,
  `articleID` varchar(255) COLLATE utf8_bin NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of comment
-- ----------------------------
BEGIN;
INSERT INTO `comment` VALUES (1, 0, '1550800739000', '2019-3-29 10:19:28', '要被一些营销号带偏了，但凡谈到谁谁谁就是沉浸角 色无法自拔。徐铮是体验派，但同时也是有加入方法派表演技巧的。', '1553238742000');
INSERT INTO `comment` VALUES (2, 1, '1551249573000', '2019-3-29 10:22:16', '                    萨达方法撒的说的萨达萨达发顺丰', '1553238742000');
INSERT INTO `comment` VALUES (3, 0, '1550800739000', '2019-3-29 14:42:38', '哈哈哈哈', '1553310680000');
INSERT INTO `comment` VALUES (4, 1, '1550800739000', '2019-3-29 14:43:04', '                    你笑个p啊', '1553310680000');
INSERT INTO `comment` VALUES (5, 2, '1550800739000', '2019-3-29 14:43:29', '                    什么？', '1553238742000');
INSERT INTO `comment` VALUES (6, 1, '1550800739000', '2019-3-29 14:49:34', '                    喵喵喵', '1553238742000');
INSERT INTO `comment` VALUES (7, 3, '1550800739000', '2019-3-29 14:53:33', '                    哈？', '1553238742000');
INSERT INTO `comment` VALUES (8, 1, '1550800739000', '2019-3-29 14:53:46', '                    ？？？', '1553238742000');
INSERT INTO `comment` VALUES (9, 111, '1550800739000', '2019-3-29 14:59:51', '                    睡凉炕的发撒地方', '1553238742000');
INSERT INTO `comment` VALUES (10, 2, '1550800739000', '2019-3-29 15:02:46', '                    这次应该是对了', '1553238742000');
INSERT INTO `comment` VALUES (11, 3, '1550800739000', '2019-3-29 15:51:46', '                    无敌是多么寂寞', '1553310680000');
INSERT INTO `comment` VALUES (12, 0, '1550800739000', '2019-3-29 18:28:39', '臥槽', '1553238742000');
INSERT INTO `comment` VALUES (13, 0, '1550800739000', '2019-3-30 15:19:00', 'hahahahahhahahahhahahahhahaha', '1553238742000');
INSERT INTO `comment` VALUES (14, 0, '1550800739000', '2019-3-30 15:25:15', 'test1', '1553855242000');
INSERT INTO `comment` VALUES (15, 0, '1550800739000', '2019-3-30 15:26:02', 'test2', '1553855242000');
INSERT INTO `comment` VALUES (16, 0, '1550800739000', '2019-3-30 15:32:34', 'test3', '1553855242000');
INSERT INTO `comment` VALUES (17, 0, '1550800739000', '2019-3-30 15:45:06', 'test4', '1553855242000');
INSERT INTO `comment` VALUES (18, 0, '1550800739000', '2019-3-30 15:48:20', 'test5', '1553855242000');
INSERT INTO `comment` VALUES (19, 0, '1550800739000', '2019-3-30 15:50:33', 'test6', '1553855242000');
INSERT INTO `comment` VALUES (20, 0, '1550800739000', '2019-3-30 15:59:08', 'test7', '1553855242000');
INSERT INTO `comment` VALUES (21, 0, '1550800739000', '2019-3-30 16:00:18', 'test8', '1553855242000');
INSERT INTO `comment` VALUES (22, 0, '1550800739000', '2019-3-30 16:00:59', 'test9', '1553855242000');
INSERT INTO `comment` VALUES (23, 22, '1550800739000', '2019-3-30 16:01:08', '                    test10', '1553855242000');
INSERT INTO `comment` VALUES (24, 6, '1553933739000', '2019-3-30 16:17:09', '                    我是李鑫', '1553238742000');
INSERT INTO `comment` VALUES (25, 0, '1553934214000', '2019-3-30 16:30:31', '沙发沙发', '1553934183000');
INSERT INTO `comment` VALUES (26, 25, '1550800739000', '2019-4-17 16:00:14', '                    沙发个p', '1553934183000');
COMMIT;

-- ----------------------------
-- Table structure for explore
-- ----------------------------
DROP TABLE IF EXISTS `explore`;
CREATE TABLE `explore` (
  `title` varchar(255) COLLATE utf8_bin NOT NULL,
  `time` varchar(255) COLLATE utf8_bin NOT NULL,
  `city` varchar(255) COLLATE utf8_bin NOT NULL,
  `cityCode` varchar(255) COLLATE utf8_bin NOT NULL,
  `imgSrc` varchar(255) COLLATE utf8_bin NOT NULL,
  `link` varchar(255) COLLATE utf8_bin NOT NULL,
  `type` varchar(255) COLLATE utf8_bin NOT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of explore
-- ----------------------------
BEGIN;
INSERT INTO `explore` VALUES ('【限量优惠】2019年Gdevops全球敏捷运维峰会-北京站', '2019-06-28 周五', '杭州', '8', 'https://activity-static.segmentfault.com/405/486/4054869473-5c6cc858439e4_medium', 'https://segmentfault.com/e/1160000018042952/join', '0', 1);
INSERT INTO `explore` VALUES ('MTSC2019 第五届中国移动互联网测试开发大会', '2019-06-28 周五', '北京', '2', 'https://activity-static.segmentfault.com/238/590/2385906813-5c4fd6b4c54ad_medium', 'https://segmentfault.com/e/1160000018042952/join', '1', 2);
INSERT INTO `explore` VALUES ('第1届全球学生开源年会', '2019-08-24 周六', '海外', '1', 'https://activity-static.segmentfault.com/197/126/1971269513-5c8f878b8478d_medium', '/e/1160000018562072/join', '1', 3);
INSERT INTO `explore` VALUES ('MTSC2019 第五届中国移动互联网测试开发大会', '2019-06-28 周五', '北京', '1', 'https://activity-static.segmentfault.com/238/590/2385906813-5c4fd6b4c54ad_medium', '/e/1160000018042952/join', '1', 4);
INSERT INTO `explore` VALUES ('HackBJ | 人工智能+创客马拉松大赛', '2019-05-11 周六', '北京', '1', 'https://activity-static.segmentfault.com/334/113/3341137827-5c8c5503d13c5_medium', '/e/1160000018525908/join', '1', 5);
INSERT INTO `explore` VALUES ('2019GIAC全球互联网架构大会', '2019-06-21 周五', '深圳', '1', 'https://activity-static.segmentfault.com/201/571/2015713642-5c81ca24cea90_medium', '/e/1160000018431339/join', '1', 6);
INSERT INTO `explore` VALUES ('第十六届“青牛杯”软件设计大赛', '2019-05-12 周日', '广州', '1', 'https://activity-static.segmentfault.com/726/941/726941105-5c7e3379c0ca0_medium', '/e/1160000018395168/join', '1', 7);
INSERT INTO `explore` VALUES ('微服务架构设计与实践', '2019-04-20 周六', '深圳', '1', 'https://activity-static.segmentfault.com/386/583/3865831905-5c6e01043ac37_medium', '/e/1160000018228704/join', '1', 8);
INSERT INTO `explore` VALUES ('O\'Reilly和Intel人工智能大会2019北京站', '2019-06-18 周二', '北京', '1', 'https://activity-static.segmentfault.com/194/967/1949673700-5c8619d60afe3_medium', '/e/1160000018461650/join', '1', 9);
INSERT INTO `explore` VALUES ('2019年Gdevops全球敏捷运维峰会-北京站', '2019-05-10 周五', '北京', '1', 'https://activity-static.segmentfault.com/405/486/4054869473-5c6cc858439e4_medium', '/e/1160000018205598/join', '1', 10);
INSERT INTO `explore` VALUES ('第一届 RustCon Asia ', '2019-04-20 周六', '北京', '1', 'https://activity-static.segmentfault.com/434/205/434205747-5c6e7179cd7ac_medium', '/e/1160000018230931/join', '1', 11);
INSERT INTO `explore` VALUES ('联合 CNCF 出品——KubeSphere 容器平台产品全新发布', '2019-04-19 周五', '北京', '1', 'https://activity-static.segmentfault.com/293/052/2930529174-5c908031cf8ae_medium', '/e/1160000018571168/join', '1', 12);
INSERT INTO `explore` VALUES ('Code Day #1 杭州站：移动端高性能架构演进与跨平台开发实践', '2019-03-31 周日', '杭州', '1', 'https://activity-static.segmentfault.com/833/529/833529408-5c8a0a9f7c464_medium', '/e/1160000018505057/join', '1', 13);
INSERT INTO `explore` VALUES ('AI学习--第三届MAD技术论坛', '2019-03-30 周六', '成都', '1', 'https://activity-static.segmentfault.com/352/858/3528587440-5c919e082a7a5_medium', '/e/1160000018574030/join', '1', 14);
INSERT INTO `explore` VALUES ('LiveVideoStackCon2019音视频技术大会（上海站）', '2019-04-19 周五', '上海', '1', 'https://activity-static.segmentfault.com/293/172/2931725916-5c2c3b28a3ad4_medium', '/e/1160000017712172/join', '1', 15);
INSERT INTO `explore` VALUES ('2019力扣杯 - 全国高校春季编程大赛', '2019-04-14 周日', '上海', '1', 'https://activity-static.segmentfault.com/302/426/3024269925-5c85d4efe2ea9_medium', '/e/1160000018457391/join', '1', 16);
INSERT INTO `explore` VALUES ('AI中台：一种敏捷的智能业务支持方案|宜信技术沙龙', '2019-03-28 周四', '北京', '1', 'https://activity-static.segmentfault.com/189/991/1899914683-5c91d4925d15a_medium', '/e/1160000018585653/join', '1', 17);
INSERT INTO `explore` VALUES ('区块链学前班：手把手教你开发DApp第一期', '2019-03-24 周日', '深圳', '1', 'https://activity-static.segmentfault.com/122/829/1228291849-5c9074c7633b4_medium', '/e/1160000018419525/join', '1', 18);
INSERT INTO `explore` VALUES ('3月17日活动', '2022-03-17', '杭州', '8', 'https://activity-static.segmentfault.com/405/486/4054869473-5c6cc858439e4_medium', 'https://activity-static.segmentfault.com/405/486/4054869473-5c6cc858439e4_medium', 'https://activity-static.segmentfault.com/405/486/4054869473-5c6cc858439e4_medium', 19);
INSERT INTO `explore` VALUES ('3月17日活动', '2022-03-17', '杭州', '8', 'https://activity-static.segmentfault.com/405/486/4054869473-5c6cc858439e4_medium', 'https://segmentfault.com/e/1160000018042952/join', '0', 20);
INSERT INTO `explore` VALUES ('3月18日活动', '2022-03-18', '杭州', '8', 'https://activity-static.segmentfault.com/405/486/4054869473-5c6cc858439e4_medium', 'https://segmentfault.com/e/1160000018042952/join', '1', 21);
COMMIT;

-- ----------------------------
-- Table structure for topics
-- ----------------------------
DROP TABLE IF EXISTS `topics`;
CREATE TABLE `topics` (
  `topicID` varchar(255) COLLATE utf8_bin NOT NULL,
  `topicName` varchar(255) COLLATE utf8_bin NOT NULL,
  `topicSum` varchar(255) COLLATE utf8_bin NOT NULL,
  `topicImg` varchar(255) COLLATE utf8_bin NOT NULL,
  `topicTitle` varchar(255) COLLATE utf8_bin NOT NULL,
  `createAt` datetime(6) NOT NULL ON UPDATE CURRENT_TIMESTAMP(6),
  `id` int(32) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=42 DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of topics
-- ----------------------------
BEGIN;
INSERT INTO `topics` VALUES ('1551855789001', '今天学到了', '3451', 'https://user-gold-cdn.xitu.io/2018/5/27/163a0f36c521fec1?imageView2/1/w/200/h/200/q/85/interlace/1', '日拱一卒，功不唐捐。\n一起来分享下你今天听到的有意思的事情，或者学习的冷知识。', '2019-03-21 17:15:28.119312', 1);
INSERT INTO `topics` VALUES ('1551855789002', '一图胜千言', '3459', 'https://user-gold-cdn.xitu.io/2018/5/15/1635f8400e159843?imageView2/1/w/200/h/200/q/85/interlace/1', '能用图，就不要用字。', '2019-03-21 16:56:04.537253', 2);
INSERT INTO `topics` VALUES ('1551855789003', '开发工具推荐', '5832', 'https://user-gold-cdn.xitu.io/2018/3/28/1626c0ac4544df09?imageView2/1/w/200/h/200/q/85/interlace/1', '来推荐一些你常用的能帮你提高效率的开发工具，不限于 IDE，开发框架，构建工具', '2019-03-30 16:31:22.089549', 3);
INSERT INTO `topics` VALUES ('1551855789004', '应用安利', '2173', 'https://user-gold-cdn.xitu.io/2018/7/20/164b58a751ad19ad?imageView2/1/w/200/h/200/q/85/interlace/1', '分享好玩、高颜值、实用的 APP、插件、扩展、小程序、H5…记得附上他们的介绍和下载地址哟', '2019-03-29 18:30:10.073512', 4);
INSERT INTO `topics` VALUES ('1551855789005', '掘金相亲', '3884', 'https://user-gold-cdn.xitu.io/2018/3/29/16270f8fac539dbc?imageView2/1/w/200/h/200/q/85/interlace/1', '千里姻缘掘金牵，有情人终成眷属。\n注意：话题下未按照格式或无关沸点会被移除话题\n必须的信息：\n- 个人信息：性别，坐标，工作；\n- 对另一半的期待：\n其他信息选填：年龄，身高体重，爱好，联系方式，照片', '2019-03-21 16:55:56.007554', 5);
INSERT INTO `topics` VALUES ('1551855789006', '今日最佳', '1295', 'https://user-gold-cdn.xitu.io/2018/8/20/1655718df67078c4?imageView2/1/w/200/h/200/q/85/interlace/1', 'The best or nothing.', '2019-04-04 09:21:19.614059', 6);
INSERT INTO `topics` VALUES ('1551855789007', '我的开源项目', '4316', 'https://user-gold-cdn.xitu.io/2018/3/28/1626bf013a8e56ef?imageView2/1/w/200/h/200/q/85/interlace/1', '来沸点曝光你的优秀开源项目\n投稿格式：\n【开源项目名 - 开源项目介绍】\n开源项目地址：https://juejin.im\n介绍：是什么，能做什么，一些故事\n加上1到3张配图。', '2019-03-21 16:55:50.551023', 7);
INSERT INTO `topics` VALUES ('1551855789008', '提问回答', '1027', 'https://user-gold-cdn.xitu.io/2018/7/6/1646da198025cc30?imageView2/1/w/200/h/200/q/85/interlace/1', '#提问回答#，所提的问题要同技术、程序员有关，参考方向：技术前景、最优解、编程问题…，涉及编程开发的问题其描述需尽可能详细；问题下的回复需同问题相关，无关内容将会视情况移除。一块通过#提问回答#茁壮成长吧~', '2019-03-21 16:55:47.593913', 8);
INSERT INTO `topics` VALUES ('1551855789009', '人在职场', '1042', 'https://user-gold-cdn.xitu.io/2018/8/11/16528816b4d285cf?imageView2/1/w/200/h/200/q/85/interlace/1', '人在职场哪能时时顺风顺水，来聊聊工作中开心与不开心的事', '2019-03-21 16:55:44.119358', 9);
INSERT INTO `topics` VALUES ('1551855789010', '优秀开源推荐', '804', 'https://user-gold-cdn.xitu.io/2018/12/7/16786baaed4306a7?imageView2/1/w/200/h/200/q/85/interlace/1', '来推荐你觉得优秀的开源项目，不限于开源框架、开发工具~', '2019-03-29 18:30:03.495765', 10);
INSERT INTO `topics` VALUES ('1551855789011', '内推信息', '5932', 'https://user-gold-cdn.xitu.io/2018/3/28/1626bf5ab8351cce?imageView2/1/w/200/h/200/q/85/interlace/1', '与大厂面对面，零距离。\n发布格式：\nJD + 公司环境配图\n（话题下非相关性沸点会做折叠处理，比如只发一句话加链接）', '2019-03-21 16:55:32.024031', 11);
INSERT INTO `topics` VALUES ('1551855789012', 'AMA', '682', 'https://user-gold-cdn.xitu.io/2018/7/16/164a29d23c531f90?imageView2/1/w/200/h/200/q/85/interlace/1', 'AMA：Ask ME Anything ，掘金团队会邀请各领域技术大牛通过「你问我答」的形式回答你的问题，让大家在技术、工作、生活方面有所成长。', '2019-03-21 16:55:29.021705', 12);
INSERT INTO `topics` VALUES ('1551855789014', '这个设计有点优秀', '553', 'https://user-gold-cdn.xitu.io/2018/11/4/166dc424e902c448?imageView2/1/w/200/h/200/q/85/interlace/1', '来分享你生活、工作中看到的好看、另类设计~', '2019-03-30 16:31:20.820461', 13);
INSERT INTO `topics` VALUES ('1551855789015', '代码写诗', '552', 'https://user-gold-cdn.xitu.io/2018/8/8/165180eb6f6c9637?imageView2/1/w/200/h/200/q/85/interlace/1', 'Talk is cheap, show me your code。用优雅的代码书写美丽诗篇，建议用在线代码图片 Carbon 生成图片，Carbon 链接：https://carbon.now.sh/', '2019-03-21 16:55:20.462237', 14);
INSERT INTO `topics` VALUES ('1551855789016', '下班打卡', '553', 'https://user-gold-cdn.xitu.io/2018/3/28/1626bf8d189e1e56?imageView2/1/w/200/h/200/q/85/interlace/1', '下班的同学来打个卡，聊聊今天过得怎么样', '2019-03-29 18:30:09.194984', 15);
INSERT INTO `topics` VALUES ('1551855789017', 'New 资讯', '553', 'https://user-gold-cdn.xitu.io/2019/1/22/16873e5e371931d5?imageView2/1/w/200/h/200/q/85/interlace/1', '来分享你刚看到过的商业科技 / 互联网 / 科技数码资讯吧~', '2019-03-23 11:11:38.464792', 16);
INSERT INTO `topics` VALUES ('1551855789018', '读书笔记', '552', 'https://user-gold-cdn.xitu.io/2018/3/30/16275a6754433e44?imageView2/1/w/200/h/200/q/85/interlace/1', '读不在三更五鼓，功只怕一曝十寒。', '2019-03-21 16:55:05.396558', 17);
INSERT INTO `topics` VALUES ('1551855789019', '上班摸鱼', '552', 'https://user-gold-cdn.xitu.io/2018/12/12/167a0256fa93abb0?imageView2/1/w/200/h/200/q/85/interlace/1', '来分享下你上班看到的好东西吧~', '2019-03-21 16:55:02.471704', 18);
INSERT INTO `topics` VALUES ('1551855789020', '年中总结', '552', 'https://user-gold-cdn.xitu.io/2018/7/1/16454b18986972e5?imageView2/1/w/200/h/200/q/85/interlace/1', '上半年结束了，年初的小目标完成的怎么样啦？\n\n参考格式：\n\n- 用 3 个关键词概括上半年，eg：脱单、跳槽、加薪、star 过 1k…\n- 展开描述上半年总结', '2019-03-21 16:54:56.220678', 19);
INSERT INTO `topics` VALUES ('1551855789021', '划个知识点', '552', 'https://user-gold-cdn.xitu.io/2018/12/10/1679781887d8aa3b?imageView2/1/w/200/h/200/q/85/interlace/1', '分享下你刚学到的知识点，不仅限于代码笔记', '2019-03-21 16:54:53.862620', 20);
INSERT INTO `topics` VALUES ('1551855789022', '每天一道算法题', '552', 'https://user-gold-cdn.xitu.io/2018/3/28/1626c1bc2798945c?imageView2/1/w/200/h/200/q/85/interlace/1', '每天精选一道算法题，帮助你更好地精进。', '2019-03-21 16:54:48.757339', 21);
INSERT INTO `topics` VALUES ('1551855789023', '薅羊毛', '552', 'https://user-gold-cdn.xitu.io/2018/3/28/1626c197673a7817?imageView2/1/w/200/h/200/q/85/interlace/1', '走过路过不要错过，软件降价通知，App Store 限免，能薅的都在这里', '2019-03-21 16:54:44.381977', 22);
INSERT INTO `topics` VALUES ('1551855789024', '我 & 掘金', '553', 'https://user-gold-cdn.xitu.io/2018/12/11/1679b3f7f3194335?imageView2/1/w/200/h/200/q/85/interlace/1', '来晒晒掘金给你发的周边，还有你发生在掘金里的事情，文章阅读破百万，收获 1w 个粉丝啦~', '2019-03-23 11:11:41.819416', 23);
INSERT INTO `topics` VALUES ('1551855789025', '朴素一餐', '553', 'https://user-gold-cdn.xitu.io/2018/3/28/1626c1710c37ece5?imageView2/1/w/200/h/200/q/85/interlace/1', '分享一下咱程序员每天都吃了啥。', '2019-03-23 11:11:37.163021', 24);
INSERT INTO `topics` VALUES ('1551855789026', '掘金官方', '552', 'https://user-gold-cdn.xitu.io/2018/11/21/16735bbad3500a6c?imageView2/1/w/200/h/200/q/85/interlace/1', '关注该话题你可以看到掘金官方消息', '2019-03-21 16:54:31.902793', 25);
INSERT INTO `topics` VALUES ('1551855789027', '反馈 & 建议', '552', 'https://user-gold-cdn.xitu.io/2019/2/18/168fe22f90f63c06?imageView2/1/w/200/h/200/q/85/interlace/1', '大家可以在这里给掘金提需求、反馈 bug，每一条内容我们都会看，掘金的产品、设计、开发也会经常和大家互动。', '2019-03-21 16:54:25.614284', 26);
INSERT INTO `topics` VALUES ('1551855789028', '树洞一下', '552', 'https://user-gold-cdn.xitu.io/2018/11/22/1673a95cceee34db?imageView2/1/w/200/h/200/q/85/interlace/1', '来分享下你的开心和不开心，此话题下内容统一由官方机器人账号代发，本话题只讲故事~', '2019-03-21 16:54:22.703705', 27);
INSERT INTO `topics` VALUES ('1551855789029', '大佬说', '552', 'https://user-gold-cdn.xitu.io/2018/7/12/1648defb2fa34ce1?imageView2/1/w/200/h/200/q/85/interlace/1', '今天大佬们又说了啥，对此，你怎么看？大佬的定义为为大家共知的，左耳朵耗子，知名框架作者，例如 Swoole 作者等等…', '2019-03-23 10:53:40.115413', 28);
INSERT INTO `topics` VALUES ('1551855789030', '定个小目标', '552', 'https://user-gold-cdn.xitu.io/2018/12/4/167782a6a7c8b816?imageView2/1/w/200/h/200/q/85/interlace/1', '先定个小目标，完成了记得评论个 Done~', '2019-03-21 16:54:13.145144', 29);
INSERT INTO `topics` VALUES ('1551855789031', '代码秀', '552', 'https://user-gold-cdn.xitu.io/2018/9/13/165d267a0720a057?imageView2/1/w/200/h/200/q/85/interlace/1', '不论语言，不计行数，show show 你的代码片段。建议用在线代码图片 Carbon 生成图片，Carbon 链接：https://carbon.now.sh/。', '2019-03-30 16:31:23.155135', 30);
INSERT INTO `topics` VALUES ('1551855789032', '什么值得买', '552', 'https://user-gold-cdn.xitu.io/2018/10/22/16699ec1e40ea1d5?imageView2/1/w/200/h/200/q/85/interlace/1', '一起来分享你买过的好东西吧~', '2019-03-23 11:11:52.322161', 31);
INSERT INTO `topics` VALUES ('1551855789033', '谷歌开发者大会', '553', 'https://user-gold-cdn.xitu.io/2018/9/19/165eff0a6d839c83?imageView2/1/w/200/h/200/q/85/interlace/1', '谷歌开发者大会（Google Developer Days，简称 GDD）是展示 Google 最新开发者产品和平台的全球盛会。你可以在这里发布、了解最新的大会信息~', '2019-03-30 17:59:40.578141', 32);
INSERT INTO `topics` VALUES ('1551855789034', '求职中', '552', 'https://user-gold-cdn.xitu.io/2018/12/29/167f895de55ecd98?imageView2/1/w/200/h/200/q/85/interlace/1', '在这里发布你的求职信息，包括：\n必要：工作年限、求职领域、会的技能点；\n选填：项目经历、年龄、教育背景；\n（话题下不符合话题要求的沸点将被移除，如果找到满意的工作记得删掉求职沸点哟~~）', '2019-03-21 16:54:00.441977', 33);
INSERT INTO `topics` VALUES ('1551855789035', '年终总结', '552', 'https://user-gold-cdn.xitu.io/2018/12/3/167716e00c55522c?imageView2/1/w/200/h/200/q/85/interlace/1', '一年又要结束了，年初的小目标完成的怎么样啦？\n\n参考格式：\n- 用 1 个句话概括即将过去的 2018 年，eg：GitHub 绿了 365 天…或者用 3 个关键词概括一年，eg：#脱单#、#加薪#、#离职#…\n- 展开描述一年总结', '2019-03-21 16:53:56.697061', 34);
INSERT INTO `topics` VALUES ('1551855789036', 'Google IO', '553', 'https://user-gold-cdn.xitu.io/2018/5/3/16324238af34ba06?imageView2/1/w/200/h/200/q/85/interlace/1', '2018年 Google IO 就要来了，你感觉又会发布哪些新技术，哪些新的技术方向？', '2019-04-04 09:21:35.483276', 35);
INSERT INTO `topics` VALUES ('1551855789037', '掘金前端小组', '553', 'https://user-gold-cdn.xitu.io/2018/12/11/1679b81bcaa2c98d?imageView2/1/w/200/h/200/q/85/interlace/1', '本话题主理人为：@yck\n\n在这个话题下：\n1. 分享自己不知道如何解决的前端问题\n2. 分享前端的小知识点\n3. 分享前端面试经历与面试题\n4. 分享前端最新的技术动态，比如 Vue、React 框架动态\n5. 分享有趣好玩的前端梗', '2019-03-23 10:53:56.332317', 36);
INSERT INTO `topics` VALUES ('1551855789038', '掘金开发者大会', '553', 'https://user-gold-cdn.xitu.io/2018/8/8/16518adb76ace294?imageView2/1/w/200/h/200/q/85/interlace/1', '掘金开发者大会 · 微信小程序专场将于9月16日在北京富力万丽酒店举行，目前早鸟票在限时优惠中~', '2019-03-30 16:31:23.865556', 37);
INSERT INTO `topics` VALUES ('1551855789039', '进击的 React', '552', 'https://user-gold-cdn.xitu.io/2018/12/21/167cee49ac013efa?imageView2/1/w/200/h/200/q/85/interlace/1', '本话题主理人为：程墨\n\n在这个话题下，你可以进行 React 技术及前端开发的前沿讨论与资讯分享。', '2019-03-21 16:53:38.578526', 38);
INSERT INTO `topics` VALUES ('1551855789040', '好文推荐', '552', 'https://user-gold-cdn.xitu.io/2018/12/21/167d075b19a7367a?imageView2/1/w/200/h/200/q/85/interlace/1', '在这里分享你发现的优质掘金文章 & 其他平台文章，可以自荐，所有沸点在发布后 24 小时没能获得 3 个点赞将会从话题下移除，但原内容保留(≧▽≦)', '2019-03-21 16:53:34.866866', 39);
INSERT INTO `topics` VALUES ('1551855789041', 'WWDC', '553', 'https://user-gold-cdn.xitu.io/2018/5/16/1636829c1b1ada64?imageView2/1/w/200/h/200/q/85/interlace/1', 'WWDC - 苹果全球开发者大会，是苹果公司每年定期在美国加州举办的会议活动，主要目的是向该公司产品的相关软件的设计师们展示最新的软件和技术。', '2019-04-04 09:21:17.255548', 40);
INSERT INTO `topics` VALUES ('1551855789042', 'LC3-2018', '552', 'https://user-gold-cdn.xitu.io/2018/6/21/16421062e9cb22c3?imageView2/1/w/200/h/200/q/85/interlace/1', 'LC3 会议覆盖了开源界讨论最多、研究范围最广、实践探索最前沿的热点话题。', '2019-03-21 16:53:22.648020', 41);
COMMIT;

-- ----------------------------
-- Table structure for userfollows
-- ----------------------------
DROP TABLE IF EXISTS `userfollows`;
CREATE TABLE `userfollows` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `userID` varchar(255) COLLATE utf8_bin NOT NULL,
  `topicID` varchar(255) COLLATE utf8_bin NOT NULL,
  `createAt` datetime NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of userfollows
-- ----------------------------
BEGIN;
INSERT INTO `userfollows` VALUES (12, '1550800739000', '1551855789037', '2019-03-23 10:53:56');
INSERT INTO `userfollows` VALUES (13, '1550800739000', '1551855789025', '2019-03-23 11:11:36');
INSERT INTO `userfollows` VALUES (14, '1550800739000', '1551855789017', '2019-03-23 11:11:38');
INSERT INTO `userfollows` VALUES (15, '1550800739000', '1551855789031', '2019-03-23 11:11:39');
INSERT INTO `userfollows` VALUES (17, '1550800739000', '1551855789024', '2019-03-23 11:11:41');
INSERT INTO `userfollows` VALUES (18, '1550800739000', '1551855789016', '2019-03-29 18:30:09');
INSERT INTO `userfollows` VALUES (19, '1550800739000', '1551855789004', '2019-03-29 18:30:10');
INSERT INTO `userfollows` VALUES (20, '1553934214000', '1551855789014', '2019-03-30 16:31:20');
INSERT INTO `userfollows` VALUES (21, '1553934214000', '1551855789003', '2019-03-30 16:31:22');
INSERT INTO `userfollows` VALUES (22, '1553934214000', '1551855789038', '2019-03-30 16:31:23');
INSERT INTO `userfollows` VALUES (23, '1553934214000', '1551855789033', '2019-03-30 17:59:40');
INSERT INTO `userfollows` VALUES (24, '1550800739000', '1551855789041', '2019-04-04 09:21:16');
INSERT INTO `userfollows` VALUES (25, '1550800739000', '1551855789006', '2019-04-04 09:21:19');
INSERT INTO `userfollows` VALUES (26, '1550800739000', '1551855789036', '2019-04-04 09:21:35');
COMMIT;

-- ----------------------------
-- Table structure for userinfo
-- ----------------------------
DROP TABLE IF EXISTS `userinfo`;
CREATE TABLE `userinfo` (
  `userID` varchar(20) COLLATE utf8_bin NOT NULL,
  `userName` varchar(255) COLLATE utf8_bin NOT NULL,
  `password` varchar(20) COLLATE utf8_bin NOT NULL,
  `phone` varchar(11) COLLATE utf8_bin NOT NULL,
  `email` varchar(255) COLLATE utf8_bin NOT NULL,
  `createAt` date NOT NULL,
  `state` int(1) unsigned zerofill NOT NULL,
  `id` int(255) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8 COLLATE=utf8_bin ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of userinfo
-- ----------------------------
BEGIN;
INSERT INTO `userinfo` VALUES ('1550800739000', 'lokep', '960827', '15557106128', 'iamlokep@163.com', '2019-02-22', 0, 1);
INSERT INTO `userinfo` VALUES ('1551249573000', 'xuhui', '123456', '18516876125', '18516876125@qq.com', '2019-02-27', 0, 2);
INSERT INTO `userinfo` VALUES ('1553934214000', '李鑫', '123456', '15512345678', 'iamlokep@163.com', '2019-03-30', 0, 8);
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
